"""
Задача 1. Дано перший член та різниця арифметичної прогресії.
Написати рекурсивну функцію для обчислення 𝑛-го члена прогресії
та суми перших 𝑛 чисел.

"""

def nth_term(a1, d, n):
    
    if n == 1:
        return a1
    return nth_term(a1, d, n - 1) + d


def sum_progression(a1, d, n):
    
    if n == 1:
        return a1
    return nth_term(a1, d, n) + sum_progression(a1, d, n - 1)


# -------- Основна програма --------
a1 = float(input("Введіть перший член прогресії a1: "))
d = float(input("Введіть різницю прогресії d: "))
n = int(input("Введіть номер члена n: "))

an = nth_term(a1, d, n)
s = sum_progression(a1, d, n)

print("n-й член арифметичної прогресії:", an)
print("Сума перших n членів прогресії:", s)
